---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewPrintedEventArgs Properties
ViewPrintedEventArgs Class See Also Send Feedback
---

The ViewPrintedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | Document | The document associated with the event.  (Inherited from RevitAPIPostDocEventArgs.) |
|  | Index | The index of the view being printed out of the set of all views being printed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).  (Inherited from RevitAPIPostEventArgs.) |
|  | TotalViews | The number of all views being printed. |
|  | View | The view that was printed. |

# See Also

ViewPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace